bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_ahbp_reg.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once


#ifdef __cplusplus
extern "C" {
#endif


#define SYS_AHBP_REG0_ADDR (SOC_SYS_AHBP_REG_BASE + (0x0 << 2))

#define SYS_AHBP_REG0_DEVICEID_POS (0)
#define SYS_AHBP_REG0_DEVICEID_MASK (0xffffffff)

#define SYS_AHBP_REG1_ADDR (SOC_SYS_AHBP_REG_BASE + (0x1 << 2))

#define SYS_AHBP_REG1_VERSIONID_POS (0)
#define SYS_AHBP_REG1_VERSIONID_MASK (0xffffffff)

#define SYS_AHBP_REG2_ADDR (SOC_SYS_AHBP_REG_BASE + (0x2 << 2))

#define SYS_AHBP_REG2_RESERVED_0_0_POS (0)
#define SYS_AHBP_REG2_RESERVED_0_0_MASK (0x1)

#define SYS_AHBP_REG2_CLKG_BYPASS_POS (1)
#define SYS_AHBP_REG2_CLKG_BYPASS_MASK (0x1)

#define SYS_AHBP_REG2_RESERVED_2_31_POS (2)
#define SYS_AHBP_REG2_RESERVED_2_31_MASK (0x3fffffff)

#define SYS_AHBP_REG3_ADDR (SOC_SYS_AHBP_REG_BASE + (0x3 << 2))

#define SYS_AHBP_REG3_CPU0_SLEEPING_POS (0)
#define SYS_AHBP_REG3_CPU0_SLEEPING_MASK (0x1)

#define SYS_AHBP_REG3_CPU0_DEEPSLEEP_POS (1)
#define SYS_AHBP_REG3_CPU0_DEEPSLEEP_MASK (0x1)

#define SYS_AHBP_REG3_CPU1_SLEEPING_POS (2)
#define SYS_AHBP_REG3_CPU1_SLEEPING_MASK (0x1)

#define SYS_AHBP_REG3_CPU1_DEEPSLEEP_POS (3)
#define SYS_AHBP_REG3_CPU1_DEEPSLEEP_MASK (0x1)

#define SYS_AHBP_REG3_RESERVED_BIT_4_31_POS (4)
#define SYS_AHBP_REG3_RESERVED_BIT_4_31_MASK (0xfffffff)

#define SYS_AHBP_REG4_ADDR (SOC_SYS_AHBP_REG_BASE + (0x4 << 2))

#define SYS_AHBP_REG4_CPU0_SW_RSTN_POS (0)
#define SYS_AHBP_REG4_CPU0_SW_RSTN_MASK (0x1)

#define SYS_AHBP_REG4_CPU0_INIT_DTCM_EN_POS (1)
#define SYS_AHBP_REG4_CPU0_INIT_DTCM_EN_MASK (0x1)

#define SYS_AHBP_REG4_CPU0_SYS_NMI_POS (2)
#define SYS_AHBP_REG4_CPU0_SYS_NMI_MASK (0x1)

#define SYS_AHBP_REG4_CPU0_WFE_SRC_POS (3)
#define SYS_AHBP_REG4_CPU0_WFE_SRC_MASK (0x1)

#define SYS_AHBP_REG4_CPU0_WFE_PULSE_POS (4)
#define SYS_AHBP_REG4_CPU0_WFE_PULSE_MASK (0x1)

#define SYS_AHBP_REG4_CPU0_WAIT_POS (5)
#define SYS_AHBP_REG4_CPU0_WAIT_MASK (0x1)

#define SYS_AHBP_REG4_CPU0_DBG_RSTN_DISABLE_POS (6)
#define SYS_AHBP_REG4_CPU0_DBG_RSTN_DISABLE_MASK (0x1)

#define SYS_AHBP_REG4_RESERVED_7_7_POS (7)
#define SYS_AHBP_REG4_RESERVED_7_7_MASK (0x1)

#define SYS_AHBP_REG4_CPU0_OFFSET_POS (8)
#define SYS_AHBP_REG4_CPU0_OFFSET_MASK (0xffffff)

#define SYS_AHBP_REG5_ADDR (SOC_SYS_AHBP_REG_BASE + (0x5 << 2))

#define SYS_AHBP_REG5_CPU1_SW_RSTN_POS (0)
#define SYS_AHBP_REG5_CPU1_SW_RSTN_MASK (0x1)

#define SYS_AHBP_REG5_CPU1_INIT_DTCM_EN_POS (1)
#define SYS_AHBP_REG5_CPU1_INIT_DTCM_EN_MASK (0x1)

#define SYS_AHBP_REG5_CPU1_SYS_NMI_POS (2)
#define SYS_AHBP_REG5_CPU1_SYS_NMI_MASK (0x1)

#define SYS_AHBP_REG5_CPU1_WFE_SRC_POS (3)
#define SYS_AHBP_REG5_CPU1_WFE_SRC_MASK (0x1)

#define SYS_AHBP_REG5_CPU1_WFE_PULSE_POS (4)
#define SYS_AHBP_REG5_CPU1_WFE_PULSE_MASK (0x1)

#define SYS_AHBP_REG5_CPU1_WAIT_POS (5)
#define SYS_AHBP_REG5_CPU1_WAIT_MASK (0x1)

#define SYS_AHBP_REG5_CPU1_DBG_RSTN_DISABLE_POS (6)
#define SYS_AHBP_REG5_CPU1_DBG_RSTN_DISABLE_MASK (0x1)

#define SYS_AHBP_REG5_RESERVED_7_7_POS (7)
#define SYS_AHBP_REG5_RESERVED_7_7_MASK (0x1)

#define SYS_AHBP_REG5_CPU1_OFFSET_POS (8)
#define SYS_AHBP_REG5_CPU1_OFFSET_MASK (0xffffff)

#define SYS_AHBP_REG6_ADDR (SOC_SYS_AHBP_REG_BASE + (0x6 << 2))

#define SYS_AHBP_REG6_NPU_SW_RSTN_POS (0)
#define SYS_AHBP_REG6_NPU_SW_RSTN_MASK (0x1)

#define SYS_AHBP_REG6_NPU_CLKBPS_POS (1)
#define SYS_AHBP_REG6_NPU_CLKBPS_MASK (0x1)

#define SYS_AHBP_REG6_AXI0_AWCACHE_POS (2)
#define SYS_AHBP_REG6_AXI0_AWCACHE_MASK (0xf)

#define SYS_AHBP_REG6_AXI0_ARCACHE_POS (6)
#define SYS_AHBP_REG6_AXI0_ARCACHE_MASK (0xf)

#define SYS_AHBP_REG6_AXI1_AWCACHE_POS (10)
#define SYS_AHBP_REG6_AXI1_AWCACHE_MASK (0xf)

#define SYS_AHBP_REG6_AXI1_ARCACHE_POS (14)
#define SYS_AHBP_REG6_AXI1_ARCACHE_MASK (0xf)

#define SYS_AHBP_REG6_CACHE_SRC_POS (18)
#define SYS_AHBP_REG6_CACHE_SRC_MASK (0x1)

#define SYS_AHBP_REG6_RESERVED_19_31_POS (19)
#define SYS_AHBP_REG6_RESERVED_19_31_MASK (0x1fff)

#define SYS_AHBP_REG7_ADDR (SOC_SYS_AHBP_REG_BASE + (0x7 << 2))

#define SYS_AHBP_REG7_PSRAM_INV_CONFIG_POS (0)
#define SYS_AHBP_REG7_PSRAM_INV_CONFIG_MASK (0x3)

#define SYS_AHBP_REG7_VIDEOPOST_M_ARCACHE_POS (2)
#define SYS_AHBP_REG7_VIDEOPOST_M_ARCACHE_MASK (0xf)

#define SYS_AHBP_REG7_VIDEOPOST_M_AWCACHE_POS (6)
#define SYS_AHBP_REG7_VIDEOPOST_M_AWCACHE_MASK (0xf)

#define SYS_AHBP_REG7_RESERVED_10_15_POS (10)
#define SYS_AHBP_REG7_RESERVED_10_15_MASK (0x3f)

#define SYS_AHBP_REG7_ICACHE_CLEAN_MODE_POS (16)
#define SYS_AHBP_REG7_ICACHE_CLEAN_MODE_MASK (0x1)

#define SYS_AHBP_REG7_CPU0_ICACHE_CLEAN_MODE_POS (17)
#define SYS_AHBP_REG7_CPU0_ICACHE_CLEAN_MODE_MASK (0x1)

#define SYS_AHBP_REG7_CPU0_ICACHE_CLEAN_TAG_SEL_POS (18)
#define SYS_AHBP_REG7_CPU0_ICACHE_CLEAN_TAG_SEL_MASK (0x1)

#define SYS_AHBP_REG7_CPU1_ICACHE_CLEAN_MODE_POS (19)
#define SYS_AHBP_REG7_CPU1_ICACHE_CLEAN_MODE_MASK (0x1)

#define SYS_AHBP_REG7_CPU1_ICACHE_CLEAN_TAG_SEL_POS (20)
#define SYS_AHBP_REG7_CPU1_ICACHE_CLEAN_TAG_SEL_MASK (0x1)

#define SYS_AHBP_REG7_RESERVED_21_23_POS (21)
#define SYS_AHBP_REG7_RESERVED_21_23_MASK (0x7)

#define SYS_AHBP_REG7_ICACHE_CLEAN_KEY_POS (24)
#define SYS_AHBP_REG7_ICACHE_CLEAN_KEY_MASK (0xff)

#define SYS_AHBP_REG8_ADDR (SOC_SYS_AHBP_REG_BASE + (0x8 << 2))

#define SYS_AHBP_REG8_CKSEL_CORE_POS (0)
#define SYS_AHBP_REG8_CKSEL_CORE_MASK (0x3)

#define SYS_AHBP_REG8_CKDIV_CORE_POS (2)
#define SYS_AHBP_REG8_CKDIV_CORE_MASK (0x3)

#define SYS_AHBP_REG8_CKDIV_BUS_LS_POS (4)
#define SYS_AHBP_REG8_CKDIV_BUS_LS_MASK (0x1)

#define SYS_AHBP_REG8_RESERVED_5_5_POS (5)
#define SYS_AHBP_REG8_RESERVED_5_5_MASK (0x1)

