bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_ahbp_reg.h
#define SYS_AHBP_REG8_CKDIV_UART4_POS (6)
#define SYS_AHBP_REG8_CKDIV_UART4_MASK (0xf)

#define SYS_AHBP_REG8_CKSEL_QSPI0_POS (10)
#define SYS_AHBP_REG8_CKSEL_QSPI0_MASK (0x1)

#define SYS_AHBP_REG8_CKDIV_QSPI0_POS (11)
#define SYS_AHBP_REG8_CKDIV_QSPI0_MASK (0xf)

#define SYS_AHBP_REG8_CKSEL_QSPI1_POS (15)
#define SYS_AHBP_REG8_CKSEL_QSPI1_MASK (0x1)

#define SYS_AHBP_REG8_CKDIV_QSPI1_POS (16)
#define SYS_AHBP_REG8_CKDIV_QSPI1_MASK (0xf)

#define SYS_AHBP_REG8_CKSEL_PRAM0_POS (20)
#define SYS_AHBP_REG8_CKSEL_PRAM0_MASK (0x3)

#define SYS_AHBP_REG8_CKDIV_PRAM0_POS (22)
#define SYS_AHBP_REG8_CKDIV_PRAM0_MASK (0x1)

#define SYS_AHBP_REG8_CKSEL_MBIST_POS (23)
#define SYS_AHBP_REG8_CKSEL_MBIST_MASK (0x1)

#define SYS_AHBP_REG8_CKDIV_SDIO0_POS (24)
#define SYS_AHBP_REG8_CKDIV_SDIO0_MASK (0xf)

#define SYS_AHBP_REG8_CKDIV_SDIO1_POS (28)
#define SYS_AHBP_REG8_CKDIV_SDIO1_MASK (0xf)

#define SYS_AHBP_REG9_ADDR (SOC_SYS_AHBP_REG_BASE + (0x9 << 2))

#define SYS_AHBP_REG9_CKSEL_CIS_MCLK_POS (0)
#define SYS_AHBP_REG9_CKSEL_CIS_MCLK_MASK (0x3)

#define SYS_AHBP_REG9_CKDIV_CIS_MCLK_POS (2)
#define SYS_AHBP_REG9_CKDIV_CIS_MCLK_MASK (0xf)

#define SYS_AHBP_REG9_CKDIV_CIS_AUXS_POS (6)
#define SYS_AHBP_REG9_CKDIV_CIS_AUXS_MASK (0xf)

#define SYS_AHBP_REG9_CKSEL_CISP_POS (10)
#define SYS_AHBP_REG9_CKSEL_CISP_MASK (0x1)

#define SYS_AHBP_REG9_CKDIV_CISP_POS (11)
#define SYS_AHBP_REG9_CKDIV_CISP_MASK (0x3)

#define SYS_AHBP_REG9_CKSEL_GPU_POS (13)
#define SYS_AHBP_REG9_CKSEL_GPU_MASK (0x1)

#define SYS_AHBP_REG9_CKDIV_GPU_POS (14)
#define SYS_AHBP_REG9_CKDIV_GPU_MASK (0x3)

#define SYS_AHBP_REG9_CKSEL_H265_POS (16)
#define SYS_AHBP_REG9_CKSEL_H265_MASK (0x1)

#define SYS_AHBP_REG9_CKDIV_H265_POS (17)
#define SYS_AHBP_REG9_CKDIV_H265_MASK (0x3)

#define SYS_AHBP_REG9_CKSEL_DPU_POS (19)
#define SYS_AHBP_REG9_CKSEL_DPU_MASK (0x1)

#define SYS_AHBP_REG9_CKDIV_DPU_POS (20)
#define SYS_AHBP_REG9_CKDIV_DPU_MASK (0x1f)

#define SYS_AHBP_REG9_CKSEL_PRAM1_POS (25)
#define SYS_AHBP_REG9_CKSEL_PRAM1_MASK (0x3)

#define SYS_AHBP_REG9_CKDIV_PRAM1_POS (27)
#define SYS_AHBP_REG9_CKDIV_PRAM1_MASK (0x1)

#define SYS_AHBP_REG9_CKDIV_TRACE_POS (28)
#define SYS_AHBP_REG9_CKDIV_TRACE_MASK (0x3)

#define SYS_AHBP_REG9_CKSEL_CIS_AUXS_POS (30)
#define SYS_AHBP_REG9_CKSEL_CIS_AUXS_MASK (0x3)

#define SYS_AHBP_REGA_ADDR (SOC_SYS_AHBP_REG_BASE + (0xa << 2))

#define SYS_AHBP_REGA_CPUA_CKEN_POS (0)
#define SYS_AHBP_REGA_CPUA_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_UART5_CKEN_POS (1)
#define SYS_AHBP_REGA_UART5_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_USB_HS_CKEN_POS (2)
#define SYS_AHBP_REGA_USB_HS_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_PRAM0_CKEN_POS (3)
#define SYS_AHBP_REGA_PRAM0_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_PRAM1_CKEN_POS (4)
#define SYS_AHBP_REGA_PRAM1_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_QSPI0_CKEN_POS (5)
#define SYS_AHBP_REGA_QSPI0_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_QSPI1_CKEN_POS (6)
#define SYS_AHBP_REGA_QSPI1_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_SDIO0_CKEN_POS (7)
#define SYS_AHBP_REGA_SDIO0_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_SDIO1_CKEN_POS (8)
#define SYS_AHBP_REGA_SDIO1_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_CISP_CKEN_POS (9)
#define SYS_AHBP_REGA_CISP_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_GPU_CKEN_POS (10)
#define SYS_AHBP_REGA_GPU_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_H26E_CKEN_POS (11)
#define SYS_AHBP_REGA_H26E_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_CSI_CKEN_POS (12)
#define SYS_AHBP_REGA_CSI_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_DSI_CKEN_POS (13)
#define SYS_AHBP_REGA_DSI_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_DPU_CKEN_POS (14)
#define SYS_AHBP_REGA_DPU_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_USB_FS_CKEN_POS (15)
#define SYS_AHBP_REGA_USB_FS_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_CONF0_CKEN_POS (16)
#define SYS_AHBP_REGA_CONF0_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_CONF1_CKEN_POS (17)
#define SYS_AHBP_REGA_CONF1_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_CONF2_CKEN_POS (18)
#define SYS_AHBP_REGA_CONF2_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_CONF3_CKEN_POS (19)
#define SYS_AHBP_REGA_CONF3_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_CPU0_CKEN_POS (20)
#define SYS_AHBP_REGA_CPU0_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_CPU1_CKEN_POS (21)
#define SYS_AHBP_REGA_CPU1_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_NPU_CKEN_POS (22)
#define SYS_AHBP_REGA_NPU_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_TIMER4_CKEN_POS (23)
#define SYS_AHBP_REGA_TIMER4_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_TIMER5_CKEN_POS (24)
#define SYS_AHBP_REGA_TIMER5_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_TRACE_CKEN_POS (25)
#define SYS_AHBP_REGA_TRACE_CKEN_MASK (0x1)

#define SYS_AHBP_REGA_RESERVED_26_31_POS (26)
#define SYS_AHBP_REGA_RESERVED_26_31_MASK (0x3f)

#define SYS_AHBP_REGB_ADDR (SOC_SYS_AHBP_REG_BASE + (0xb << 2))

#define SYS_AHBP_REGB_PHASE_CK640_POS (0)
#define SYS_AHBP_REGB_PHASE_CK640_MASK (0xff)

#define SYS_AHBP_REGB_RESERVED_8_31_POS (8)
#define SYS_AHBP_REGB_RESERVED_8_31_MASK (0xffffff)

#define SYS_AHBP_REGC_ADDR (SOC_SYS_AHBP_REG_BASE + (0xc << 2))

#define SYS_AHBP_REGC_CPU0_MEM_SD_POS (0)
#define SYS_AHBP_REGC_CPU0_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_CPU1_MEM_SD_POS (1)
#define SYS_AHBP_REGC_CPU1_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_DTCM_MEM_SD_POS (2)
#define SYS_AHBP_REGC_DTCM_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_L2CH_MEM_SD_POS (3)
#define SYS_AHBP_REGC_L2CH_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_MEM3_MEM_SD_POS (4)
#define SYS_AHBP_REGC_MEM3_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_MEM4_MEM_SD_POS (5)
#define SYS_AHBP_REGC_MEM4_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_MEM5_MEM_SD_POS (6)
#define SYS_AHBP_REGC_MEM5_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_MEM6_MEM_SD_POS (7)
#define SYS_AHBP_REGC_MEM6_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_AHBP_MEM_SD_POS (8)
#define SYS_AHBP_REGC_AHBP_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_H265_MEM_SD_POS (9)
#define SYS_AHBP_REGC_H265_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_GPUB_MEM_SD_POS (10)
#define SYS_AHBP_REGC_GPUB_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_DPUB_MEM_SD_POS (11)
#define SYS_AHBP_REGC_DPUB_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_DISB_MEM_SD_POS (12)
#define SYS_AHBP_REGC_DISB_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_H264_MEM_SD_POS (13)
#define SYS_AHBP_REGC_H264_MEM_SD_MASK (0x1)

