bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_ahbp_reg.h
#define SYS_AHBP_REGC_ISPB_MEM_SD_POS (14)
#define SYS_AHBP_REGC_ISPB_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_CSIB_MEM_SD_POS (15)
#define SYS_AHBP_REGC_CSIB_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_NPUB_MEM_SD_POS (16)
#define SYS_AHBP_REGC_NPUB_MEM_SD_MASK (0x1)

#define SYS_AHBP_REGC_RESERVED_17_31_POS (17)
#define SYS_AHBP_REGC_RESERVED_17_31_MASK (0x7fff)

#define SYS_AHBP_REGD_ADDR (SOC_SYS_AHBP_REG_BASE + (0xd << 2))

#define SYS_AHBP_REGD_CPU0_MEM_DS_POS (0)
#define SYS_AHBP_REGD_CPU0_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_CPU1_MEM_DS_POS (1)
#define SYS_AHBP_REGD_CPU1_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_DTCM_MEM_DS_POS (2)
#define SYS_AHBP_REGD_DTCM_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_L2CH_MEM_DS_POS (3)
#define SYS_AHBP_REGD_L2CH_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_MEM3_MEM_DS_POS (4)
#define SYS_AHBP_REGD_MEM3_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_MEM4_MEM_DS_POS (5)
#define SYS_AHBP_REGD_MEM4_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_MEM5_MEM_DS_POS (6)
#define SYS_AHBP_REGD_MEM5_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_MEM6_MEM_DS_POS (7)
#define SYS_AHBP_REGD_MEM6_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_AHBP_MEM_DS_POS (8)
#define SYS_AHBP_REGD_AHBP_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_H265_MEM_DS_POS (9)
#define SYS_AHBP_REGD_H265_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_GPUB_MEM_DS_POS (10)
#define SYS_AHBP_REGD_GPUB_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_DPUB_MEM_DS_POS (11)
#define SYS_AHBP_REGD_DPUB_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_DISB_MEM_DS_POS (12)
#define SYS_AHBP_REGD_DISB_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_H264_MEM_DS_POS (13)
#define SYS_AHBP_REGD_H264_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_ISPB_MEM_DS_POS (14)
#define SYS_AHBP_REGD_ISPB_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_CSIB_MEM_DS_POS (15)
#define SYS_AHBP_REGD_CSIB_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_NPUB_MEM_DS_POS (16)
#define SYS_AHBP_REGD_NPUB_MEM_DS_MASK (0x1)

#define SYS_AHBP_REGD_RESERVED_17_31_POS (17)
#define SYS_AHBP_REGD_RESERVED_17_31_MASK (0x7fff)

#define SYS_AHBP_REGE_ADDR (SOC_SYS_AHBP_REG_BASE + (0xe << 2))

#define SYS_AHBP_REGE_SYSTEM_HALT_EN_POS (0)
#define SYS_AHBP_REGE_SYSTEM_HALT_EN_MASK (0x1)

#define SYS_AHBP_REGE_SYSTEM_HALT_HIGH_CPU0WFI_POS (1)
#define SYS_AHBP_REGE_SYSTEM_HALT_HIGH_CPU0WFI_MASK (0x1)

#define SYS_AHBP_REGE_SYSTEM_HALT_HIGH_CPU1WFI_POS (2)
#define SYS_AHBP_REGE_SYSTEM_HALT_HIGH_CPU1WFI_MASK (0x1)

#define SYS_AHBP_REGE_RESERVED_3_7_POS (3)
#define SYS_AHBP_REGE_RESERVED_3_7_MASK (0x1f)

#define SYS_AHBP_REGE_CPU_HALT_EN_POS (8)
#define SYS_AHBP_REGE_CPU_HALT_EN_MASK (0x1)

#define SYS_AHBP_REGE_CPU_HALT_HIGH_CPU0WFI_POS (9)
#define SYS_AHBP_REGE_CPU_HALT_HIGH_CPU0WFI_MASK (0x1)

#define SYS_AHBP_REGE_CPU_HALT_HIGH_CPU1WFI_POS (10)
#define SYS_AHBP_REGE_CPU_HALT_HIGH_CPU1WFI_MASK (0x1)

#define SYS_AHBP_REGE_RESERVED_11_15_POS (11)
#define SYS_AHBP_REGE_RESERVED_11_15_MASK (0x1f)

#define SYS_AHBP_REGE_PWD_M55_POS (16)
#define SYS_AHBP_REGE_PWD_M55_MASK (0x1)

#define SYS_AHBP_REGE_PWD_VIDEO_POST_POS (17)
#define SYS_AHBP_REGE_PWD_VIDEO_POST_MASK (0x1)

#define SYS_AHBP_REGE_PWD_H26E_POS (18)
#define SYS_AHBP_REGE_PWD_H26E_MASK (0x1)

#define SYS_AHBP_REGE_PWD_ISP_POS (19)
#define SYS_AHBP_REGE_PWD_ISP_MASK (0x1)

#define SYS_AHBP_REGE_PWD_NPU_POS (20)
#define SYS_AHBP_REGE_PWD_NPU_MASK (0x1)

#define SYS_AHBP_REGE_RESERVED_21_23_POS (21)
#define SYS_AHBP_REGE_RESERVED_21_23_MASK (0x7)

#define SYS_AHBP_REGE_SOFT_RSTN_ISP_POS (24)
#define SYS_AHBP_REGE_SOFT_RSTN_ISP_MASK (0x1)

#define SYS_AHBP_REGE_SOFT_RSTN_H264E_POS (25)
#define SYS_AHBP_REGE_SOFT_RSTN_H264E_MASK (0x1)

#define SYS_AHBP_REGE_SOFT_RSTN_H264D_POS (26)
#define SYS_AHBP_REGE_SOFT_RSTN_H264D_MASK (0x1)

#define SYS_AHBP_REGE_SOFT_RSTN_GPU_POS (27)
#define SYS_AHBP_REGE_SOFT_RSTN_GPU_MASK (0x1)

#define SYS_AHBP_REGE_SOFT_RSTN_DPU_POS (28)
#define SYS_AHBP_REGE_SOFT_RSTN_DPU_MASK (0x1)

#define SYS_AHBP_REGE_RESERVED_29_31_POS (29)
#define SYS_AHBP_REGE_RESERVED_29_31_MASK (0x7)

#define SYS_AHBP_REGF_ADDR (SOC_SYS_AHBP_REG_BASE + (0xf << 2))

#define SYS_AHBP_REGF_WWDT_REGION_WWDT_POS (0)
#define SYS_AHBP_REGF_WWDT_REGION_WWDT_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_SYS_CFG_POS (1)
#define SYS_AHBP_REGF_WWDT_REGION_SYS_CFG_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_BUSX_POS (2)
#define SYS_AHBP_REGF_WWDT_REGION_BUSX_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_CPU0_POS (3)
#define SYS_AHBP_REGF_WWDT_REGION_CPU0_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_CPU1_POS (4)
#define SYS_AHBP_REGF_WWDT_REGION_CPU1_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_AHBP_POS (5)
#define SYS_AHBP_REGF_WWDT_REGION_AHBP_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_SMEM3_POS (6)
#define SYS_AHBP_REGF_WWDT_REGION_SMEM3_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_SMEM4_POS (7)
#define SYS_AHBP_REGF_WWDT_REGION_SMEM4_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_SMEM5_POS (8)
#define SYS_AHBP_REGF_WWDT_REGION_SMEM5_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_SMEM6_POS (9)
#define SYS_AHBP_REGF_WWDT_REGION_SMEM6_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_NPU_POS (10)
#define SYS_AHBP_REGF_WWDT_REGION_NPU_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_H26E_POS (11)
#define SYS_AHBP_REGF_WWDT_REGION_H26E_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_ISP_POS (12)
#define SYS_AHBP_REGF_WWDT_REGION_ISP_MASK (0x1)

#define SYS_AHBP_REGF_WWDT_REGION_VIDEO_POST_POS (13)
#define SYS_AHBP_REGF_WWDT_REGION_VIDEO_POST_MASK (0x1)

#define SYS_AHBP_REGF_RESERVED_14_31_POS (14)
#define SYS_AHBP_REGF_RESERVED_14_31_MASK (0x3ffff)

#define SYS_AHBP_REG10_ADDR (SOC_SYS_AHBP_REG_BASE + (0x10 << 2))

#define SYS_AHBP_REG10_INTS_CONFIG_M55A_0_POS (0)
#define SYS_AHBP_REG10_INTS_CONFIG_M55A_0_MASK (0xffffffff)

#define SYS_AHBP_REG11_ADDR (SOC_SYS_AHBP_REG_BASE + (0x11 << 2))

#define SYS_AHBP_REG11_INTS_CONFIG_M55A_1_POS (0)
#define SYS_AHBP_REG11_INTS_CONFIG_M55A_1_MASK (0xffffffff)

#define SYS_AHBP_REG12_ADDR (SOC_SYS_AHBP_REG_BASE + (0x12 << 2))

