bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_ahbp_reg.h
#define SYS_AHBP_REG12_INTS_CONFIG_M55B_0_POS (0)
#define SYS_AHBP_REG12_INTS_CONFIG_M55B_0_MASK (0xffffffff)

#define SYS_AHBP_REG13_ADDR (SOC_SYS_AHBP_REG_BASE + (0x13 << 2))

#define SYS_AHBP_REG13_INTS_CONFIG_M55B_1_POS (0)
#define SYS_AHBP_REG13_INTS_CONFIG_M55B_1_MASK (0xffffffff)

#define SYS_AHBP_REG14_ADDR (SOC_SYS_AHBP_REG_BASE + (0x14 << 2))

#define SYS_AHBP_REG14_INTS_CONFIG_M52S_0_POS (0)
#define SYS_AHBP_REG14_INTS_CONFIG_M52S_0_MASK (0xffffffff)

#define SYS_AHBP_REG15_ADDR (SOC_SYS_AHBP_REG_BASE + (0x15 << 2))

#define SYS_AHBP_REG15_INTS_CONFIG_M52S_1_POS (0)
#define SYS_AHBP_REG15_INTS_CONFIG_M52S_1_MASK (0xffffffff)

#define SYS_AHBP_REG16_ADDR (SOC_SYS_AHBP_REG_BASE + (0x16 << 2))

#define SYS_AHBP_REG16_INTS_CONFIG_SCR1_0_POS (0)
#define SYS_AHBP_REG16_INTS_CONFIG_SCR1_0_MASK (0xffffffff)

#define SYS_AHBP_REG17_ADDR (SOC_SYS_AHBP_REG_BASE + (0x17 << 2))

#define SYS_AHBP_REG17_INTS_CONFIG_SCR1_1_POS (0)
#define SYS_AHBP_REG17_INTS_CONFIG_SCR1_1_MASK (0xffffffff)

#define SYS_AHBP_REG18_ADDR (SOC_SYS_AHBP_REG_BASE + (0x18 << 2))

#define SYS_AHBP_REG18_INTS_STATUS_M55A_0_POS (0)
#define SYS_AHBP_REG18_INTS_STATUS_M55A_0_MASK (0xffffffff)

#define SYS_AHBP_REG19_ADDR (SOC_SYS_AHBP_REG_BASE + (0x19 << 2))

#define SYS_AHBP_REG19_INTS_STATUS_M55A_1_POS (0)
#define SYS_AHBP_REG19_INTS_STATUS_M55A_1_MASK (0xffffffff)

#define SYS_AHBP_REG1A_ADDR (SOC_SYS_AHBP_REG_BASE + (0x1a << 2))

#define SYS_AHBP_REG1A_INTS_STATUS_M55B_0_POS (0)
#define SYS_AHBP_REG1A_INTS_STATUS_M55B_0_MASK (0xffffffff)

#define SYS_AHBP_REG1B_ADDR (SOC_SYS_AHBP_REG_BASE + (0x1b << 2))

#define SYS_AHBP_REG1B_INTS_STATUS_M55B_1_POS (0)
#define SYS_AHBP_REG1B_INTS_STATUS_M55B_1_MASK (0xffffffff)

#define SYS_AHBP_REG1C_ADDR (SOC_SYS_AHBP_REG_BASE + (0x1c << 2))

#define SYS_AHBP_REG1C_INTS_STATUS_M52S_0_POS (0)
#define SYS_AHBP_REG1C_INTS_STATUS_M52S_0_MASK (0xffffffff)

#define SYS_AHBP_REG1D_ADDR (SOC_SYS_AHBP_REG_BASE + (0x1d << 2))

#define SYS_AHBP_REG1D_INTS_STATUS_M52S_1_POS (0)
#define SYS_AHBP_REG1D_INTS_STATUS_M52S_1_MASK (0xffffffff)

#define SYS_AHBP_REG1E_ADDR (SOC_SYS_AHBP_REG_BASE + (0x1e << 2))

#define SYS_AHBP_REG1E_INTS_STATUS_SCR1_0_POS (0)
#define SYS_AHBP_REG1E_INTS_STATUS_SCR1_0_MASK (0xffffffff)

#define SYS_AHBP_REG1F_ADDR (SOC_SYS_AHBP_REG_BASE + (0x1f << 2))

#define SYS_AHBP_REG1F_INTS_STATUS_SCR1_1_POS (0)
#define SYS_AHBP_REG1F_INTS_STATUS_SCR1_1_MASK (0xffffffff)

#define SYS_AHBP_REG20_ADDR (SOC_SYS_AHBP_REG_BASE + (0x20 << 2))

#define SYS_AHBP_REG20_CPU0_QOS_POS (0)
#define SYS_AHBP_REG20_CPU0_QOS_MASK (0x3)

#define SYS_AHBP_REG20_DMA1_QOS_POS (2)
#define SYS_AHBP_REG20_DMA1_QOS_MASK (0x3)

#define SYS_AHBP_REG20_SDIO0_QOS_POS (4)
#define SYS_AHBP_REG20_SDIO0_QOS_MASK (0x3)

#define SYS_AHBP_REG20_SDIO1_QOS_POS (6)
#define SYS_AHBP_REG20_SDIO1_QOS_MASK (0x3)

#define SYS_AHBP_REG20_ENET0_QOS_POS (8)
#define SYS_AHBP_REG20_ENET0_QOS_MASK (0x3)

#define SYS_AHBP_REG20_ENET1_QOS_POS (10)
#define SYS_AHBP_REG20_ENET1_QOS_MASK (0x3)

#define SYS_AHBP_REG20_USB_QOS_POS (12)
#define SYS_AHBP_REG20_USB_QOS_MASK (0x3)

#define SYS_AHBP_REG20_H26E_QOS_POS (14)
#define SYS_AHBP_REG20_H26E_QOS_MASK (0x3)

#define SYS_AHBP_REG20_ISP_QOS_POS (16)
#define SYS_AHBP_REG20_ISP_QOS_MASK (0x3)

#define SYS_AHBP_REG20_VIDEOPOST_QOS_POS (18)
#define SYS_AHBP_REG20_VIDEOPOST_QOS_MASK (0x3)

#define SYS_AHBP_REG20_DPU_QOS_POS (20)
#define SYS_AHBP_REG20_DPU_QOS_MASK (0x3)

#define SYS_AHBP_REG20_CBUS_QOS_POS (22)
#define SYS_AHBP_REG20_CBUS_QOS_MASK (0x3)

#define SYS_AHBP_REG20_NPU0_QOS_POS (24)
#define SYS_AHBP_REG20_NPU0_QOS_MASK (0x3)

#define SYS_AHBP_REG20_NPU1_QOS_POS (26)
#define SYS_AHBP_REG20_NPU1_QOS_MASK (0x3)

#define SYS_AHBP_REG20_CPU1_QOS_POS (28)
#define SYS_AHBP_REG20_CPU1_QOS_MASK (0x3)

#define SYS_AHBP_REG20_RESERVED_30_31_POS (30)
#define SYS_AHBP_REG20_RESERVED_30_31_MASK (0x3)

#define SYS_AHBP_REG21_ADDR (SOC_SYS_AHBP_REG_BASE + (0x21 << 2))

#define SYS_AHBP_REG21_DPU_GATE_CPU_EN_POS (0)
#define SYS_AHBP_REG21_DPU_GATE_CPU_EN_MASK (0x1)

#define SYS_AHBP_REG21_DPU_GATE_VIDEOPOST_EN_POS (1)
#define SYS_AHBP_REG21_DPU_GATE_VIDEOPOST_EN_MASK (0x1)

#define SYS_AHBP_REG21_DPU_GATE_H26E_EN_POS (2)
#define SYS_AHBP_REG21_DPU_GATE_H26E_EN_MASK (0x1)

#define SYS_AHBP_REG21_RESERVED_3_7_POS (3)
#define SYS_AHBP_REG21_RESERVED_3_7_MASK (0x1f)

#define SYS_AHBP_REG21_RESERVED_8_8_POS (8)
#define SYS_AHBP_REG21_RESERVED_8_8_MASK (0x1)

#define SYS_AHBP_REG21_DPU_GATE_VIDEOPOST_OVERRIDE_POS (9)
#define SYS_AHBP_REG21_DPU_GATE_VIDEOPOST_OVERRIDE_MASK (0x1)

#define SYS_AHBP_REG21_DPU_GATE_H26E_OVERRIDE_POS (10)
#define SYS_AHBP_REG21_DPU_GATE_H26E_OVERRIDE_MASK (0x1)

#define SYS_AHBP_REG21_RESERVED_11_15_POS (11)
#define SYS_AHBP_REG21_RESERVED_11_15_MASK (0x1f)

#define SYS_AHBP_REG21_CPU_BUS_DIS_POS (16)
#define SYS_AHBP_REG21_CPU_BUS_DIS_MASK (0x1)

#define SYS_AHBP_REG21_VIDEOPOST_BUS_DIS_POS (17)
#define SYS_AHBP_REG21_VIDEOPOST_BUS_DIS_MASK (0x1)

#define SYS_AHBP_REG21_H26E_BUS_DIS_POS (18)
#define SYS_AHBP_REG21_H26E_BUS_DIS_MASK (0x1)

#define SYS_AHBP_REG21_RESERVED_19_23_POS (19)
#define SYS_AHBP_REG21_RESERVED_19_23_MASK (0x1f)

#define SYS_AHBP_REG21_DPU_GATE_KEY_POS (24)
#define SYS_AHBP_REG21_DPU_GATE_KEY_MASK (0xff)

#define SYS_AHBP_REG22_ADDR (SOC_SYS_AHBP_REG_BASE + (0x22 << 2))

#define SYS_AHBP_REG22_DBUG_CONFIG0_POS (0)
#define SYS_AHBP_REG22_DBUG_CONFIG0_MASK (0xffffffff)

#define SYS_AHBP_REG23_ADDR (SOC_SYS_AHBP_REG_BASE + (0x23 << 2))

#define SYS_AHBP_REG23_DBUG_MUX_POS (0)
#define SYS_AHBP_REG23_DBUG_MUX_MASK (0xf)

#define SYS_AHBP_REG23_DBUG_CONFIG1_POS (4)
#define SYS_AHBP_REG23_DBUG_CONFIG1_MASK (0xfffffff)

#define SYS_AHBP_REG24_ADDR (SOC_SYS_AHBP_REG_BASE + (0x24 << 2))

#define SYS_AHBP_REG24_TRACE_CONFIG_POS (0)
#define SYS_AHBP_REG24_TRACE_CONFIG_MASK (0xffffffff)

#define SYS_AHBP_REG25_ADDR (SOC_SYS_AHBP_REG_BASE + (0x25 << 2))

#define SYS_AHBP_REG25_GPIO_DBUG_READOUT_POS (0)
#define SYS_AHBP_REG25_GPIO_DBUG_READOUT_MASK (0xffffffff)

