bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_ahbp_reg.h
#define SYS_AHBP_REG26_ADDR (SOC_SYS_AHBP_REG_BASE + (0x26 << 2))

#define SYS_AHBP_REG26_GENERAL0_POS (0)
#define SYS_AHBP_REG26_GENERAL0_MASK (0xffffffff)

#define SYS_AHBP_REG27_ADDR (SOC_SYS_AHBP_REG_BASE + (0x27 << 2))

#define SYS_AHBP_REG27_GENERAL1_POS (0)
#define SYS_AHBP_REG27_GENERAL1_MASK (0xffffffff)

#define SYS_AHBP_REG28_ADDR (SOC_SYS_AHBP_REG_BASE + (0x28 << 2))

#define SYS_AHBP_REG28_GPU_BUFFA_ENABLE_POS (0)
#define SYS_AHBP_REG28_GPU_BUFFA_ENABLE_MASK (0x1)

#define SYS_AHBP_REG28_RESERVED_BIT_1_31_POS (1)
#define SYS_AHBP_REG28_RESERVED_BIT_1_31_MASK (0x7fffffff)

#define SYS_AHBP_REG29_ADDR (SOC_SYS_AHBP_REG_BASE + (0x29 << 2))

#define SYS_AHBP_REG29_GPU_BUFFA_BEGIN_POS (0)
#define SYS_AHBP_REG29_GPU_BUFFA_BEGIN_MASK (0xffffffff)

#define SYS_AHBP_REG2A_ADDR (SOC_SYS_AHBP_REG_BASE + (0x2a << 2))

#define SYS_AHBP_REG2A_GPU_BUFFA_SIZE_POS (0)
#define SYS_AHBP_REG2A_GPU_BUFFA_SIZE_MASK (0xffffffff)

#define SYS_AHBP_REG2B_ADDR (SOC_SYS_AHBP_REG_BASE + (0x2b << 2))

#define SYS_AHBP_REG2B_GPU_PICA_BEGIN_POS (0)
#define SYS_AHBP_REG2B_GPU_PICA_BEGIN_MASK (0xffffffff)

#define SYS_AHBP_REG2C_ADDR (SOC_SYS_AHBP_REG_BASE + (0x2c << 2))

#define SYS_AHBP_REG2C_GPU_PICA_HALFBUFF_END_POS (0)
#define SYS_AHBP_REG2C_GPU_PICA_HALFBUFF_END_MASK (0xffffffff)

#define SYS_AHBP_REG2D_ADDR (SOC_SYS_AHBP_REG_BASE + (0x2d << 2))

#define SYS_AHBP_REG2D_GPU_PICA_END_POS (0)
#define SYS_AHBP_REG2D_GPU_PICA_END_MASK (0xffffffff)

#define SYS_AHBP_REG2E_ADDR (SOC_SYS_AHBP_REG_BASE + (0x2e << 2))

#define SYS_AHBP_REG2E_RESERVED_0_31_POS (0)
#define SYS_AHBP_REG2E_RESERVED_0_31_MASK (0xffffffff)

#define SYS_AHBP_REG2F_ADDR (SOC_SYS_AHBP_REG_BASE + (0x2f << 2))

#define SYS_AHBP_REG2F_GPU_BUFFA_REMAP_ADDR_POS (0)
#define SYS_AHBP_REG2F_GPU_BUFFA_REMAP_ADDR_MASK (0xffffffff)

#define SYS_AHBP_REG30_ADDR (SOC_SYS_AHBP_REG_BASE + (0x30 << 2))

#define SYS_AHBP_REG30_GPU_BUFFB_ENABLE_POS (0)
#define SYS_AHBP_REG30_GPU_BUFFB_ENABLE_MASK (0x1)

#define SYS_AHBP_REG30_RESERVED_BIT_1_31_POS (1)
#define SYS_AHBP_REG30_RESERVED_BIT_1_31_MASK (0x7fffffff)

#define SYS_AHBP_REG31_ADDR (SOC_SYS_AHBP_REG_BASE + (0x31 << 2))

#define SYS_AHBP_REG31_GPU_BUFFB_BEGIN_POS (0)
#define SYS_AHBP_REG31_GPU_BUFFB_BEGIN_MASK (0xffffffff)

#define SYS_AHBP_REG32_ADDR (SOC_SYS_AHBP_REG_BASE + (0x32 << 2))

#define SYS_AHBP_REG32_GPU_BUFFB_SIZE_POS (0)
#define SYS_AHBP_REG32_GPU_BUFFB_SIZE_MASK (0xffffffff)

#define SYS_AHBP_REG33_ADDR (SOC_SYS_AHBP_REG_BASE + (0x33 << 2))

#define SYS_AHBP_REG33_GPU_PICB_BEGIN_POS (0)
#define SYS_AHBP_REG33_GPU_PICB_BEGIN_MASK (0xffffffff)

#define SYS_AHBP_REG34_ADDR (SOC_SYS_AHBP_REG_BASE + (0x34 << 2))

#define SYS_AHBP_REG34_GPU_PICB_HALFBUFF_END_POS (0)
#define SYS_AHBP_REG34_GPU_PICB_HALFBUFF_END_MASK (0xffffffff)

#define SYS_AHBP_REG35_ADDR (SOC_SYS_AHBP_REG_BASE + (0x35 << 2))

#define SYS_AHBP_REG35_GPU_PICB_END_POS (0)
#define SYS_AHBP_REG35_GPU_PICB_END_MASK (0xffffffff)

#define SYS_AHBP_REG36_ADDR (SOC_SYS_AHBP_REG_BASE + (0x36 << 2))

#define SYS_AHBP_REG36_RESERVED_0_31_POS (0)
#define SYS_AHBP_REG36_RESERVED_0_31_MASK (0xffffffff)

#define SYS_AHBP_REG37_ADDR (SOC_SYS_AHBP_REG_BASE + (0x37 << 2))

#define SYS_AHBP_REG37_GPU_BUFFB_REMAP_ADDR_POS (0)
#define SYS_AHBP_REG37_GPU_BUFFB_REMAP_ADDR_MASK (0xffffffff)

#define SYS_AHBP_REG38_ADDR (SOC_SYS_AHBP_REG_BASE + (0x38 << 2))

#define SYS_AHBP_REG38_H26D_BUFFA_ENABLE_POS (0)
#define SYS_AHBP_REG38_H26D_BUFFA_ENABLE_MASK (0x1)

#define SYS_AHBP_REG38_RESERVED_BIT_1_31_POS (1)
#define SYS_AHBP_REG38_RESERVED_BIT_1_31_MASK (0x7fffffff)

#define SYS_AHBP_REG39_ADDR (SOC_SYS_AHBP_REG_BASE + (0x39 << 2))

#define SYS_AHBP_REG39_H26D_BUFFA_BEGIN_POS (0)
#define SYS_AHBP_REG39_H26D_BUFFA_BEGIN_MASK (0xffffffff)

#define SYS_AHBP_REG3A_ADDR (SOC_SYS_AHBP_REG_BASE + (0x3a << 2))

#define SYS_AHBP_REG3A_H26D_BUFFA_SIZE_POS (0)
#define SYS_AHBP_REG3A_H26D_BUFFA_SIZE_MASK (0xffffffff)

#define SYS_AHBP_REG3B_ADDR (SOC_SYS_AHBP_REG_BASE + (0x3b << 2))

#define SYS_AHBP_REG3B_H26D_PICA_BEGIN_POS (0)
#define SYS_AHBP_REG3B_H26D_PICA_BEGIN_MASK (0xffffffff)

#define SYS_AHBP_REG3C_ADDR (SOC_SYS_AHBP_REG_BASE + (0x3c << 2))

#define SYS_AHBP_REG3C_H26D_PICA_HALFBUFF_END_POS (0)
#define SYS_AHBP_REG3C_H26D_PICA_HALFBUFF_END_MASK (0xffffffff)

#define SYS_AHBP_REG3D_ADDR (SOC_SYS_AHBP_REG_BASE + (0x3d << 2))

#define SYS_AHBP_REG3D_H26D_PICA_END_POS (0)
#define SYS_AHBP_REG3D_H26D_PICA_END_MASK (0xffffffff)

#define SYS_AHBP_REG3E_ADDR (SOC_SYS_AHBP_REG_BASE + (0x3e << 2))

#define SYS_AHBP_REG3E_RESERVED_0_31_POS (0)
#define SYS_AHBP_REG3E_RESERVED_0_31_MASK (0xffffffff)

#define SYS_AHBP_REG3F_ADDR (SOC_SYS_AHBP_REG_BASE + (0x3f << 2))

#define SYS_AHBP_REG3F_H26D_BUFFA_REMAP_ADDR_POS (0)
#define SYS_AHBP_REG3F_H26D_BUFFA_REMAP_ADDR_MASK (0xffffffff)

#define SYS_AHBP_REG40_ADDR (SOC_SYS_AHBP_REG_BASE + (0x40 << 2))

#define SYS_AHBP_REG40_H26D_BUFFB_ENABLE_POS (0)
#define SYS_AHBP_REG40_H26D_BUFFB_ENABLE_MASK (0x1)

#define SYS_AHBP_REG40_RESERVED_BIT_1_31_POS (1)
#define SYS_AHBP_REG40_RESERVED_BIT_1_31_MASK (0x7fffffff)

#define SYS_AHBP_REG41_ADDR (SOC_SYS_AHBP_REG_BASE + (0x41 << 2))

#define SYS_AHBP_REG41_H26D_BUFFB_BEGIN_POS (0)
#define SYS_AHBP_REG41_H26D_BUFFB_BEGIN_MASK (0xffffffff)

#define SYS_AHBP_REG42_ADDR (SOC_SYS_AHBP_REG_BASE + (0x42 << 2))

#define SYS_AHBP_REG42_H26D_BUFFB_SIZE_POS (0)
#define SYS_AHBP_REG42_H26D_BUFFB_SIZE_MASK (0xffffffff)

#define SYS_AHBP_REG43_ADDR (SOC_SYS_AHBP_REG_BASE + (0x43 << 2))

#define SYS_AHBP_REG43_H26D_PICB_BEGIN_POS (0)
#define SYS_AHBP_REG43_H26D_PICB_BEGIN_MASK (0xffffffff)

#define SYS_AHBP_REG44_ADDR (SOC_SYS_AHBP_REG_BASE + (0x44 << 2))

#define SYS_AHBP_REG44_H26D_PICB_HALFBUFF_END_POS (0)
#define SYS_AHBP_REG44_H26D_PICB_HALFBUFF_END_MASK (0xffffffff)

#define SYS_AHBP_REG45_ADDR (SOC_SYS_AHBP_REG_BASE + (0x45 << 2))

#define SYS_AHBP_REG45_H26D_PICB_END_POS (0)
#define SYS_AHBP_REG45_H26D_PICB_END_MASK (0xffffffff)

