bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_ahbp_reg.h
#define SYS_AHBP_REG46_ADDR (SOC_SYS_AHBP_REG_BASE + (0x46 << 2))

#define SYS_AHBP_REG46_RESERVED_0_31_POS (0)
#define SYS_AHBP_REG46_RESERVED_0_31_MASK (0xffffffff)

#define SYS_AHBP_REG47_ADDR (SOC_SYS_AHBP_REG_BASE + (0x47 << 2))

#define SYS_AHBP_REG47_H26D_BUFFB_REMAP_ADDR_POS (0)
#define SYS_AHBP_REG47_H26D_BUFFB_REMAP_ADDR_MASK (0xffffffff)

#define SYS_AHBP_REG48_ADDR (SOC_SYS_AHBP_REG_BASE + (0x48 << 2))

#define SYS_AHBP_REG48_H26D_BUFFC_ENABLE_POS (0)
#define SYS_AHBP_REG48_H26D_BUFFC_ENABLE_MASK (0x1)

#define SYS_AHBP_REG48_RESERVED_BIT_1_31_POS (1)
#define SYS_AHBP_REG48_RESERVED_BIT_1_31_MASK (0x7fffffff)

#define SYS_AHBP_REG49_ADDR (SOC_SYS_AHBP_REG_BASE + (0x49 << 2))

#define SYS_AHBP_REG49_H26D_BUFFC_BEGIN_POS (0)
#define SYS_AHBP_REG49_H26D_BUFFC_BEGIN_MASK (0xffffffff)

#define SYS_AHBP_REG4A_ADDR (SOC_SYS_AHBP_REG_BASE + (0x4a << 2))

#define SYS_AHBP_REG4A_H26D_BUFFC_SIZE_POS (0)
#define SYS_AHBP_REG4A_H26D_BUFFC_SIZE_MASK (0xffffffff)

#define SYS_AHBP_REG4B_ADDR (SOC_SYS_AHBP_REG_BASE + (0x4b << 2))

#define SYS_AHBP_REG4B_H26D_PICC_BEGIN_POS (0)
#define SYS_AHBP_REG4B_H26D_PICC_BEGIN_MASK (0xffffffff)

#define SYS_AHBP_REG4C_ADDR (SOC_SYS_AHBP_REG_BASE + (0x4c << 2))

#define SYS_AHBP_REG4C_H26D_PICC_HALFBUFF_END_POS (0)
#define SYS_AHBP_REG4C_H26D_PICC_HALFBUFF_END_MASK (0xffffffff)

#define SYS_AHBP_REG4D_ADDR (SOC_SYS_AHBP_REG_BASE + (0x4d << 2))

#define SYS_AHBP_REG4D_H26D_PICC_END_POS (0)
#define SYS_AHBP_REG4D_H26D_PICC_END_MASK (0xffffffff)

#define SYS_AHBP_REG4E_ADDR (SOC_SYS_AHBP_REG_BASE + (0x4e << 2))

#define SYS_AHBP_REG4E_RESERVED_0_31_POS (0)
#define SYS_AHBP_REG4E_RESERVED_0_31_MASK (0xffffffff)

#define SYS_AHBP_REG4F_ADDR (SOC_SYS_AHBP_REG_BASE + (0x4f << 2))

#define SYS_AHBP_REG4F_H26D_BUFFC_REMAP_ADDR_POS (0)
#define SYS_AHBP_REG4F_H26D_BUFFC_REMAP_ADDR_MASK (0xffffffff)

#define SYS_AHBP_REG50_ADDR (SOC_SYS_AHBP_REG_BASE + (0x50 << 2))

#define SYS_AHBP_REG50_RAM_SPSH_CFG_POS (0)
#define SYS_AHBP_REG50_RAM_SPSH_CFG_MASK (0x3ff)

#define SYS_AHBP_REG50_RAM_SPBH_CFG_POS (10)
#define SYS_AHBP_REG50_RAM_SPBH_CFG_MASK (0x7ff)

#define SYS_AHBP_REG50_RESERVED_BIT_21_23_POS (21)
#define SYS_AHBP_REG50_RESERVED_BIT_21_23_MASK (0x7)

#define SYS_AHBP_REG50_RAM_SPSH_SET_KEY_POS (24)
#define SYS_AHBP_REG50_RAM_SPSH_SET_KEY_MASK (0xff)

#define SYS_AHBP_REG51_ADDR (SOC_SYS_AHBP_REG_BASE + (0x51 << 2))

#define SYS_AHBP_REG51_RAM_STPH_CFG_POS (0)
#define SYS_AHBP_REG51_RAM_STPH_CFG_MASK (0xfff)

#define SYS_AHBP_REG51_RESERVED_BIT_12_23_POS (12)
#define SYS_AHBP_REG51_RESERVED_BIT_12_23_MASK (0xfff)

#define SYS_AHBP_REG51_RAM_STPH_SET_KEY_POS (24)
#define SYS_AHBP_REG51_RAM_STPH_SET_KEY_MASK (0xff)

#define SYS_AHBP_REG52_ADDR (SOC_SYS_AHBP_REG_BASE + (0x52 << 2))

#define SYS_AHBP_REG52_RAM_SPSL_CFG_POS (0)
#define SYS_AHBP_REG52_RAM_SPSL_CFG_MASK (0x3ff)

#define SYS_AHBP_REG52_RAM_SPBL_CFG_POS (10)
#define SYS_AHBP_REG52_RAM_SPBL_CFG_MASK (0x7ff)

#define SYS_AHBP_REG52_RESERVED_BIT_21_23_POS (21)
#define SYS_AHBP_REG52_RESERVED_BIT_21_23_MASK (0x7)

#define SYS_AHBP_REG52_RAM_SPSL_SET_KEY_POS (24)
#define SYS_AHBP_REG52_RAM_SPSL_SET_KEY_MASK (0xff)

#define SYS_AHBP_REG53_ADDR (SOC_SYS_AHBP_REG_BASE + (0x53 << 2))

#define SYS_AHBP_REG53_RAM_STPL_CFG_POS (0)
#define SYS_AHBP_REG53_RAM_STPL_CFG_MASK (0xfff)

#define SYS_AHBP_REG53_RESERVED_BIT_12_23_POS (12)
#define SYS_AHBP_REG53_RESERVED_BIT_12_23_MASK (0xfff)

#define SYS_AHBP_REG53_RAM_STPL_SET_KEY_POS (24)
#define SYS_AHBP_REG53_RAM_STPL_SET_KEY_MASK (0xff)

#ifdef __cplusplus
}
#endif
